Public Attributes | List of all members
API_Quantities Class Reference
Element Manager
Describes the different calculated values for skins of composite or complex elements. More...
#include <APIdefs_Elements.h>
 Public Attributes
 API_ElementQuantity *  | elements
Describes the different calculated values.
 GS::Array< API_CompositeQuantity > *  | composites
Describes the different calculated values for skins of composite or complex elements.
 GS::Array< API_ElemPartQuantity > *  | elemPartQuantities
Describes the different calculated values for parts of an element.
 GS::Array< API_ElemPartCompositeQuantity > *  | elemPartComposites
Describes the different calculated values for skins of composite or complex elements.
Detailed Description
Describes the different calculated values for skins of composite or complex elements.